{
  "main": {
    "name":"Gary Ng",
    "occupation":"Software Engineer",
    "description":"I'm a Indianapolis/Remote based Full Stack Engineer with over 5 years of experience who loves building things and solving problems. My expertise is building backend services with REST or Lambda.",
    "image":"profilepic.jpg",
    "bio":"When I'm not coding, you can usually find me playing table tennis, gaming, cooking, working with cars or taking pictures. My current goal in Table Tennis is to reach a rating of over 1800.",
    "contactmessage":"Feel free to leave me a message.",
    "email": "siuhungng01@gmail.com",
    "address":{
      "city":"Carmel",
      "state":"Indiana",
      "zip": "46032"
    },
    "website": "http://www..com",
    "resumedownload":"http://.com",
    "social":[
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/siu-hung-gary-ng-44a54a153/",
        "className":"faLinkedin"
      },
      {
        "name":"github",
        "url":"https://github.com/GaryNg-R",
        "className":"faGithub"
      }
    ]
  },
  "resume":{
    "skillmessage":"Self-motivated problem solving software developer. Experience in developing full stack applications. Skilled in developing & debugging cloud applications(AWS)",
    "education":
      {
        "school":"Queens College",
        "degree":"Bachelor's degree, Computer Science",
        "graduated":"December 2015"
      }
    ,
    "work":[
      {
        "company":"TEKsystems@Ford Motor",
        "title":"Software Engineer",
        "years":"Feb 2022 - Present",
        "descriptions": [
          {"description": "Designing & developing a highly scalable dealer web application with Spring Boot and Angular"},
          {"description": "Strong understanding of common API technologies, such as OAUTH, Spring Boot and Microservices"},
          {"description": "Contributed to the DevOps to automate the build and deployment process using Jenkins, Tekton, shell scripting"},
          {"description" : "Used Angular as framework to create a Single Page application which can bin data to specific views and synchronize data with server"},
          {"description": "Involved in the design and development phase of Agile Software Development"}
        ]
       },
       {
        "company":"Randstad USA @ Optum",
        "title":"Senior Software Engineer",
        "years":"Jul 2021 - Feb 2022",
        "descriptions": [
          {"description": "Created and maintained clear, concise project plans and developed strategies to meet deadlines"},
          {"description": "Develop design documents, user guides, maintenance documents, project documentation, and release documents"},
          {"description": "Write efficient, maintainable and reusable code prioritizing privacy and security "},
          {"description": "Write JSP and Servlets to add functionality to web application based on customer requirements"}
        ]
       },
       {
        "company":"Sallie Mae",
        "title":"Software Engineer II",
        "years":"Oct 2017 - Jul 2021",
        "descriptions": [
          {"description": "Modernize legacy system to AWS services, reducing operating costs and improving functionality"},
          {"description": "Completed full redesigns of existing websites with ClojureScript"},
          {"description": "Wrote efficient, maintainable and reusable code prioritizing privacy and security"},
          {"description": "Worked with team members to design and develop robust solutions to meet client requirements"},
          {"description": "Monitored and tested application performance to identify potential bottlenecks, develop solutions"},
          {"description": "Built and deployed CI/CD pipelines on MS Azure with automation test"},
          {"description": "Attended Community of Practice meetings and training seminars every two weeks"}
        ]
       }
    ],
    "skills":[
      {
        "name":"AWS",
        "level":"70%"
      },
      {
        "name":"Java/Spring Boot",
        "level":"75%"
      },
      {
        "name":"Python",
        "level":"65%"
      },
      {
        "name":"Angular",
        "level":"50%"
      },
      {
        "name":"TDD/BDD",
        "level":"80%"
      },
      {
        "name":"Git",
        "level":"70%"
      }
    ]
  }
}
